B, C = map(int, input().split())
"""
操作A: 1円払い-1倍
操作B: 2円払い-1

Aが0回
    B-C//2 : B

Aが1回
    -B-(C-1)//2 : -B+(C-1)//2

Aが2回
    B-(C-2)//2 : B+(C-2)//2

これらの範囲を重複しないよう足し合わせる
"""
B1 = (B-C//2, B)
B2 = (-B-(C-1)//2, -B+(C-1)//2)
if C > 2: B1 = (B-C//2, B+(C-2)//2)

if B >= 0:
    if B1[0] > B2[1]:
        print(B1[1]-B1[0]+1 + B2[1]-B2[0]+1)
    else:
        print(max(B1[1], B2[1]) - min(B1[0], B2[0]) + 1)
else:
    if B1[1] < B2[0]:
        print(B1[1]-B1[0]+1 + B2[1]-B2[0]+1)
    else:
        print(max(B1[1], B2[1]) - min(B1[0], B2[0]) + 1)

